---
kind: type
id: T:Autodesk.Revit.DB.InstanceVoidCutUtils
source: html/68b4818a-d737-be1e-0347-ebe305fe3b70.htm
---
# Autodesk.Revit.DB.InstanceVoidCutUtils

Utilities for cutting elements by unattached voids in family instances.

## Syntax (C#)
```csharp
public static class InstanceVoidCutUtils
```